#language: ru

Функционал: Документы ДЛКО

  @dlko9
  Структура сценария: проверка создания нового документа «Документ о списании актива» к активу
    Дано открывает сайт "http://as-sua-tst-web.dfu.i-teco.ru:7003/sua/"
    Если находится на странице "Страница поиска Яндекс Маркет"
    Если пользователь (заполняет поле) "Логин" "sua_all"
    Если пользователь (заполняет поле) "Пароль" "Q1w2e3r4"
    Если пользователь (нажимает на кнопку) "Войти"
    Если пользователь (нажимает на кнопку) "Финансовая организация"
    Если пользователь (нажимает на кнопку) "Выбрать"
    Если пользователь (открыл экранную форму) "Список активов"
    Если пользователь (нажимает на кнопку) "Сбор и ведение данных"
    Если пользователь (нажимает на кнопку) "Документы ДЛКО"
    Если пользователь (открыл экранную форму) "Документы ДЛКО"
    Если пользователь (нажимает на кнопку) "Поиск счета"
    Если пользователь (нажимает на кнопку) "Выпадающий список"
    Если пользователь (нажимает на кнопку) "Номер лицевого счета"
    Если пользователь (заполняет поле) "Поле поиска" "<Номер лицевого счета тестового актива>"
    Если пользователь (нажимает на кнопку) "Найти счет"
    Если пользователь (открыл экранную форму) "Документы ДЛКО"
    Если пользователь (устанавливает чек-бокс) "<Номер лицевого счета тестового актива>"
    Если пользователь (нажимает на кнопку) "Списание"
    Если пользователь (нажимает на кнопку) "Создать новый документ"

    Если пользователь (заполняет поле) "Наименование документа о списании" "<Наименование документа о списании>"
    Если пользователь (заполняет поле) "Основание для списания актива" "<Основание для списания актива>"
    Если пользователь (заполняет поле) "Кем утверждено списание для актива свыше лимита" "<Кем утверждено списание для актива свыше лимита>"
    Если пользователь (заполняет поле) "Кем утверждено основание для списания актива" "<Кем утверждено основание для списания актива>"
    Если пользователь (заполняет поле) "Дата утверждения основания для списания актива" "<Дата утверждения основания для списания актива>"
    Если пользователь (заполняет поле) "Дата утверждения списания для актива свыше лимита" "<Дата утверждения списания для актива свыше лимита>"
    Если пользователь (заполняет поле) "Дата основания для списания актива" "<Дата основания для списания актива>"
    Если пользователь (заполняет поле) "Дата документа о списании актива" "<Дата документа о списании актива>"
    Если пользователь (заполняет поле) "Номер документа о списании актива" "<Номер документа о списании актива>"
    Если пользователь (заполняет поле) "Номер основания для списания актива" "<Номер основания для списания актива>"
    Если пользователь (заполняет поле) "Номер утверждения списания для актива свыше лимита" "<Номер утверждения списания для актива свыше лимита>"
    Если пользователь (заполняет поле) "Номер утверждения основания для списания актива" "<Номер утверждения основания для списания актива>"

    Если пользователь (нажимает на кнопку) "Сохранить списание"
    Если пользователь (открыл экранную форму) "Документы ДЛКО"
    Если пользователь (выделяет строку) "<Номер лицевого счета тестового актива>"
    Если пользователь (проверяет созданный документ) "<Номер документа о списании актива>"
    Если пользователь (нажимает на кнопку) "Сделать таблицу первичной"
    Если пользователь (нажимает на кнопку) "Да"
    Если пользователь (устанавливает чек-бокс) "<Номер документа о списании актива>"
    Если пользователь (нажимает на кнопку) "Удалить"
    Если пользователь (нажимает на кнопку) "Да"
    Если пользователь (нажимает на кнопку) "Сделать таблицу первичной"
    Если пользователь (нажимает на кнопку) "Да"
    Если пользователь (нажимает на кнопку ID) "<Номер лицевого счета тестового актива>"
    Если пользователь (открыл экранную форму) "Просмотр актива"
    Если пользователь (нажимает на кнопку) "Редактировать"
    Если пользователь (открыл экранную форму) "Редактирование актива"
    Если пользователь (проверяет статус работы с активом) "Активный"
    Если пользователь (нажимает на кнопку) "Отмена"
    Если пользователь (открыл экранную форму) "Документы ДЛКО"
    Если пользователь (закрывает браузер) "0аргумент0"


    Примеры:
      |Номер лицевого счета тестового актива| Дата документа о списании актива | Дата основания для списания актива | Дата утверждения списания для актива свыше лимита | Дата утверждения основания для списания актива|Наименование документа о списании| Основание для списания актива | Кем утверждено списание для актива свыше лимита | Кем утверждено основание для списания актива | Номер документа о списании актива| Номер основания для списания актива| Номер утверждения списания для актива свыше лимита| Номер утверждения основания для списания актива|
      |45507810188880000010                 | 06.07.2017                       | 15.07.2018                         | 06.07.2017                                        | 15.07.2018                                    |Документ о списании              | Основание                     | Утвердитель                                     | Утвердитель                                  | 288465                           | 288465                             | 288465                                            | 288465                                         |