#language: ru

  Функционал: ДЛКО

    @scen1
    Структура сценария: создание актива сценарий 4.1.1 денежные средства
      Дано открывает сайт "http://as-sua-tst-web.dfu.i-teco.ru:7003/sua/"
      Если находится на странице "Страница поиска Яндекс Маркет"
      Если пользователь (заполняет поле) "Логин" "sua_all"
      Если пользователь (заполняет поле) "Пароль" "Q1w2e3r4"
      Если пользователь (нажимает на кнопку) "Войти"
      Если пользователь (нажимает на кнопку) "Финансовая организация"
      Если пользователь (нажимает на кнопку) "Выбрать"
      Если пользователь (нажимает на кнопку) "Сбор и ведение данных"
      Если пользователь (нажимает на кнопку) "Список активов"
      Если пользователь (нажимает на кнопку) "Создать"
      Если пользователь (нажимает на кнопку) "Тип актива"
      Если пользователь (нажимает на кнопку) "Денежные средства"
      Если пользователь (нажимает на кнопку) "Далее"
      Если находится на странице "Страница поиска Яндекс Маркет"
      Если пользователь (заполняет поле) "Номер счета" "<Номер счета>"
      Если пользователь (заполняет поле) "Начальная балансовая стоимость" "<Денежный эквивалент>"
      Если пользователь (заполняет поле) "Наименование актива" "<Наименование актива>"
      Если пользователь (нажимает на кнопку) "Сохранить актив"
      Если пользователь (проверяет созданный актив) "<Номер счета>"
     # Если пользователь (проверяет созданный актив) "Номер лицевого счета" "<Номер счета>"
      Если пользователь (нажимает на кнопку) "Чек-бокс номера"
      Если пользователь (нажимает на кнопку) "Удалить"
      Если пользователь (нажимает на кнопку) "Да"

      Примеры:
      | Номер счета        | Денежный эквивалент | Наименование актива |
      |60804810089498415648| 15000               | qwerty333           |


    @scen1.2
    Структура сценария: удаление актива
      Дано открывает сайт "http://as-sua-tst-web.dfu.i-teco.ru:7003/sua/"
      Если находится на странице "Страница поиска Яндекс Маркет"
      Если пользователь (заполняет поле) "Логин" "sua_all"
      Если пользователь (заполняет поле) "Пароль" "Q1w2e3r4"
      Если пользователь (нажимает на кнопку) "Войти"
      Если пользователь (нажимает на кнопку) "Финансовая организация"
      Если пользователь (нажимает на кнопку) "Выбрать"
      Если пользователь (нажимает на кнопку) "Сбор и ведение данных"
      Если пользователь (нажимает на кнопку) "Список активов"
      Если пользователь (нажимает на кнопку) "Создать"
      Если пользователь (нажимает на кнопку) "Тип актива"
      Если пользователь (нажимает на кнопку) "Денежные средства"
      Если пользователь (нажимает на кнопку) "Далее"
      Если находится на странице "Страница поиска Яндекс Маркет"
      Если пользователь (заполняет поле) "Номер счета" "<Номер счета>"
      Если пользователь (заполняет поле) "Начальная балансовая стоимость" "<Денежный эквивалент>"
      Если пользователь (заполняет поле) "Наименование актива" "<Наименование актива>"
      Если пользователь (нажимает на кнопку) "Сохранить актив"
      Если пользователь (нажимает на кнопку) "Чек-бокс номера"
      Если пользователь (нажимает на кнопку) "Удалить"
      Если пользователь (нажимает на кнопку) "Да"
      Если пользователь (проверяет удаленный актив) "Номер лицевого счета"

      Примеры:
        | Номер счета        | Денежный эквивалент | Наименование актива |
        |60804810089498415648| 15000               | qwerty333           |