Feature: Third Test Feature

  @CianTask
  Scenario: TestCian 1
    Given открывает сайт "https://www.cian.ru/"
    When находится на странице "Страница поиска Яндекс Маркет"
    When пользователь (нажимает на кнопку) "Купить"
    When пользователь (нажимает на кнопку) "Посуточно"
    When пользователь (нажимает на кнопку) "Квартиру"
    When пользователь (нажимает на кнопку) "Койко-место"
    When пользователь (нажимает на кнопку) "Поиск"
    When пользователь (нажимает на кнопку) "Страница 2"
    When пользователь (нажимает на кнопку) "Закрыть"
    When пользователь (ищет минимальную цену и адрес) "Цены посуточно" "Адреса"
    When пользователь (заполняет поле фильтра) "Фильтр"
    When пользователь (нажимает на кнопку) "Показать"
    When пользователь (проверяет минимальную цену) "Цены" "Адреса"

#    When пользователь (нажимает на кнопку) "Показать еще"
  #  When пользователь (делает проверку) "Список" "iphone"
  #  When пользователь (нажимает на кнопку) "Сортировать по цене"
   # When пользователь (сравнивает цены) "Цены"
    #Then Проверяет окно ввода "строку поиска"
    #Then Проверяет окно ввода "первую строку поиска"