Feature: Second Test Feature

  @InternetExplorerTask
  Scenario: Task 1
    Given открывает сайт "https://market.yandex.ru/"
    When находится на странице "Страница поиска Яндекс Маркет"
    When пользователь (заполняет поле) "Окно поиска" "iphone"
    When пользователь (нажимает на кнопку) "Найти"
#    When пользователь (нажимает на кнопку) "Показать еще"
    When пользователь (делает проверку) "Список" "iphone"
    When пользователь (нажимает на кнопку) "Сортировать по цене"
    When пользователь (сравнивает цены) "Цены"
